{"data":{"site":{"siteMetadata":{"title":"dwb-blog","author":"dwb"}},"markdownRemark":{"id":"6d35e829-ea6f-50a9-955e-db2f6c61a2d6","excerpt":"…","html":"<h2>一</h2>\n<p>我最开始看到这句话，是在高中物理必修一的第一页上，印象非常深刻，当时看到感到这句话非常大气，万物之理又寓意着“物理”，看到这句话时简直心潮澎湃，就好像看到了万物的美好，物理的瑰丽。</p>\n<p>直到最近在阅读《庄子》的时候，才发现这句话实际上是谬误理解，本意应为“割裂天地的完美，离析万物的道理”与我原来的理解完全相反，至此感到非常震撼和羞愧。于是我搜索了相关资料，发现确实大家的理解都是错误的。</p>\n<p><img src=\"http://orqz380f2.bkt.clouddn.com/W020100827536594736599.jpg\">\n<img src=\"http://orqz380f2.bkt.clouddn.com/W020110712351770832730.jpg\"></p>\n<p>首先，这句话出现在《庄子·天下》篇，这篇的主旨是表达他对天下（当时社会）的道术和学术的一些看法，这个看法大体上是各学说各执一词，有时诡辩，有时偏激，这样只会越走越远，越背离“道”的本质。</p>\n<p>我们结合上下文分析：</p>\n<p>原文是：【天下大乱，贤圣不明，道德不一。天下多得一察焉以自好。譬如耳目鼻口，皆有所明，不能相通。犹百家众技也，皆有所长，时有所用。虽然，不该不遍，一曲之士也。判天地之美，析万物之理，察古人之全。寡能备于天地之美，称神明之容。是故内圣外王之道，暗而不明，郁而不发，天下之人各为其所欲焉以自为方。悲夫！百家往而不反，必不合矣！后世之学者，不幸不见天地之纯，古人之大体。道术将为天下裂。】</p>\n<p>意译为天下很乱，道德标准多种多样，很多人得到了一孔之见就自认为很得意，百家对于道德的观点各有所长，但都只能是“一曲之士”。割裂天地的完美，离析万物之理，把古人完美的道德弄得支离破碎，（这样的人）很少能具备天地之美，相称于神明之容。因此内圣外王之道晦暗不明朗，抑郁而不发挥，天下的人都以自己所想的作为方术。太可悲了！百家各行其道不回头，必定不会相合！后世的学者不幸啊，不能见到天地的纯粹和古人的全貌，道术将被天下割裂！</p>\n<p>可见，这段话前面都是在形容百家学说的相互离散，是为了论证最后的论点：“道术将为天下裂”。因此这样理解是正确的。</p>\n<p>然而我在网络上搜索相关的信息，搜索判天地之美析万物之理，却发现所有的理解都是正面的，我粘贴几个链接：</p>\n<p><a href=\"http://www.wlqlw.com/Item/351.aspx\">http://www.wlqlw.com/Item/351.aspx</a></p>\n<p><a href=\"http://blog.163.com/liu_yuhua/blog/static/94598724201018010455/\">http://blog.163.com/liu_yuhua/blog/static/94598724201018010455/</a></p>\n<p><a href=\"http://www.zybang.com/question/ce1a7fba092f43ba07a1e65512ede933.html\">http://www.zybang.com/question/ce1a7fba092f43ba07a1e65512ede933.html</a></p>\n<p>前诺贝尔奖得主、日本著名物理学家汤川秀树，在他的一本物理书的扉页上，写着庄子的一句名言作为题记：判天地之美，析万物之理。</p>\n<p>多少中学生的心灵鸡汤还一遍遍重复这一谬误，这样的美文真适合这个年纪的人吐露他们的远大志向啊~</p>\n<p>断章取义，真不应该。</p>\n<h2>二</h2>\n<p>中学时候有篇文章，叫鱼我所欲也，其中有句话，“呼尔而与之，行道之人弗受，蹴尔而与之，乞人不屑也”，当时课文的翻译是“路过的人不接受”，我就在想，为什么不是“奉行‘道’的人不会接受”呢？我觉得我的理解也可以说得通，但是结合上下文，照应下文的“乞人”来说，翻译为路过，文章对仗更工整。</p>\n<h2>三</h2>\n<p>上面的例子还是都能说得通的情况，至少原文是固定的。后来我在网上看到一些文章，是说“人不为己天诛地灭”，</p>\n<p>各位可以在百度百科上查一下，现在还是这样的解释：</p>\n<p>【正义】君子应曰：人之初如玉璞，玉不琢不成器。有德有才是精品，有德无才是次品，无德无才是无品，有才无德是危险品。关键的关键，紧要的要紧：“人如果不先自己修身，那么就会为天地所不容”。</p>\n<p>下面的解释长篇大论，看似证据很充分。我第一次看到这个百度百科的解释的时候也信以为真，还恍然大悟，觉得自己以前理解的人不为己那种自私的小人之态真是不应该，这句话好像被大众曲解了。后来在知乎上看到了很多人细致地查阅古籍原文，确实这句话没有出处，要说出自哪里，只能说出自民谚了。人们为了一句民谚争执不休。但是民谚的本意是自私利己的意思，古籍里面的修为的意思，都是两三字而已，尚未形成“人不为己天诛地灭”的俗语。</p>\n<p>有一次在学生会的例会上，我还给干事讲过这个解释，将修为解释为正解，现在想来真是愧疚。</p>\n<h2>四</h2>\n<p>一直以来我比较喜欢古文的精炼，往往很少的字能表达复杂的含义，给人一种沉稳、干练(NB)的感觉，直达目的，没有废话。</p>\n<p>这很像现在的扁平化设计风格：去掉冗余的装饰效果，抽象、极简。缺点是很致命的，需要高学习成本，传达情感不丰富，甚至过于冰冷。</p>\n<p>如果说话也这么说，就会令别人难以理解，误解曲解会经常发生，说话晦涩也容易使人反感。</p>\n<p>说不好就成了东施效颦了。</p>","frontmatter":{"title":"判天地之美 析万物之理","date":"November 11, 2015"}}},"pageContext":{"slug":"/physics/","previous":{"fields":{"slug":"/hi-folks/"},"frontmatter":{"title":"New Beginnings","type":null}},"next":{"fields":{"slug":"/h5-develop/"},"frontmatter":{"title":"HTML5移动应用开发","type":null}}}}